#!/bin/bash
# sort options 参数
# -n 按照数值大小排序
# -r 按照相反顺序排序
# -t 设置排序时使用的分隔符，默认空格
# -k 指定需要排序的列
# -d 排序时只处理英文字母数字空格，忽略其他字符
# -f 排序时小写视作大写
# -b 忽略每行开始的空格
# -o 将排序结果输出保存指定文件
# -u 结果去重
# -m 将排序号的文件合并

cat << EOF > sort.txt
张三 60
李四 88
王五 70
zzj 92
hmh 95
hmh 95
EOF

echo "空格分隔，第二列到第二列按数值排序"
sort -t " " -k2,2n sort.txt
echo "---------------------------------------"
echo "去重"
sort -t " " -k2,2n  -uk1,2 sort.txt
echo "---------------------------------------"
echo "降序"
sort -t " " -k2,2nr sort.txt

cat << EOF > sort1.txt
张三 2301 60
李四 2302 68
王五 2301 66
周尊杰 2301 90
小花 2302 92
EOF

echo "---------------------------------------"
echo "多列排序，第二列升序，第三列降序"
sort -t " " -k2,2n -k3,3nr sort1.txt

#
